---
kind: property
id: P:Autodesk.Revit.DB.SymbolTypeId.JPerKgDegreeC
source: html/d9849186-84b8-b0eb-1652-bac3a643bcf3.htm
---
# Autodesk.Revit.DB.SymbolTypeId.JPerKgDegreeC Property

Symbol J/(kg·°C), indicating unit Joules per kilogram degree Celsius.

## Syntax (C#)
```csharp
public static ForgeTypeId JPerKgDegreeC { get; }
```